// ЗАВДАННЯ 1
// Напишіть код, який генерує випадкові цілі числа в заданих діапазонах.
// Використовуйте `Math.random()` для генерації випадкового числа від 0 до 1, а потім масштабуйте та зсувайте це число,
// щоб воно відповідало вашому діапазону.

// Використовуйте `Math.floor`, а не `Math.round` для забезпечення рівномірного розподілення випадкових чисел.
// Це гарантує, що кожне число в діапазоні має однакову ймовірність з'явлення.

// Якщо ви використовуєте `Math.round`, крайні значення (`min` та `max`) матимуть лише половину ймовірності з'явлення,
// порівняно з іншими числами. Це відбувається тому, що `Math.random()` ніколи не повертає 1, і тому максимальне
// значення з'являється лише тоді, коли `Math.random()` повертає значення, яке, будучи округленим, дорівнює `max`.

// Аналогічно, `min` з'являється лише тоді, коли `Math.random()` повертає 0.
// Тому використовуйте `Math.floor` для забезпечення рівномірного розподілення.

// =========================================================================
const min1 = 1;
const max1 = 10;

let randomNumber = Math.floor(Math.random() * (max1 - min1 + 1)) + min1;
console.log(randomNumber);

// Тут має бути ваш код, який виводить випадкове число від min1 до max1 (включно)


// =========================================================================
const min2 = 40;
const max2 = 50;

let randomNumber2 = Math.floor(Math.random() * (max2 - min2 + 1)) + min2;
console.log(randomNumber2);

// Тут має бути ваш код, який виводить випадкове число від min2 до max2 (включно)

// =========================================================================
const min3 = 1;
const max3 = 100;

let randomNumber3 = Math.floor(Math.random() * (max3 - min3 + 1)) + min3;
console.log(randomNumber3);

// Тут має бути ваш код, який виводить випадкове число від min3 до max3 (включно)

// ЗАВДАННЯ 2
// Напишіть код, який використовує дві змінних message та name для створення привітального повідомлення.
// Треба в одному випадку використати конкатенацію рядків, а в іншому - шаблонні рядки (template strings).

const message1 = "Hi";
const name1 = "John";

let greetingFirst = message1 + ',' + name1 + "!";
console.log(greetingFirst);

let greetingSecond = `${message1},${name1}!`;
console.log(greetingSecond);

// Тут має бути ваш код, який створює привітальне повідомлення за допомогою конкатенації рядків
// =========================================================================

const message2 = "Hey";
const name2 = "Bob";

let greeting = `${message2},${name2}!`;
console.log(greeting);

// Тут має бути ваш код, який створює привітальне повідомлення за допомогою шаблонних рядків (template strings)
// Нагадую, що шаблонні рядки створюються за допомогою зворотних апострофів (``) замість звичайних лапок (' ' або " ")
// =========================================================================

const message3 = "Hey";
const name3 = "Bob";

let greetingThird = `${message3},${name3}!`;
console.log(greetingThird);

// Тут має бути ваш код, який створює привітальне повідомлення за допомогою шаблонних рядків (template strings)
// Нагадую, що шаблонні рядки створюються за допомогою зворотних апострофів (``) замість звичайних лапок (' ' або " ")